Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.ThinHostWallError
Rebar Cover Interior and Exterior are too large for host.

Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.ThinHostWall
Rebar Cover Interior and Exterior are too large for host.

Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.ThinHostFloorError
Rebar Cover Top and Bottom are too large for host.

Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.ThinHostFloor
Rebar Cover Top and Bottom are too large for host.

Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.RebarSystemOffset
Rebar Cover Side/Edge is too large for sketch. Bar placement may be inaccurate.

Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.PathReinforcementWrongHost
Path Reinforcement can be placed only in Structural Floors and straight Structural Walls.

Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.HostFlagAreaOn
The Area Reinforcement element was created in a document with the Host Structural Rebar setting on, and cannot be transferred into this document, which has the setting off.

Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.DPartReinforcementDeleted
Reinforcement hosted on highlighted Parts will be deleted.

Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.DPartReinfDeletedEditDivision
Edits to the model will cause some Reinforcement hosted on Parts to be deleted.

Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.CannotPlacePathReininforcementWarn
Can't find a host for Path Reinforcement.

Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.CannotPlacePathReininforcement
Can't find a host for Path Reinforcement.

Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.CannotPlacePathReinforcementWarn
Can't find a host for Path Reinforcement.

Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.CannotPlacePathReinforcement
Can't find a host for Path Reinforcement.

Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.CannotPlaceAreaReininforcementWarn
Can't find a host for Area Reinforcement.

Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.CannotPlaceAreaReininforcement
Can't find a host for Area Reinforcement.

Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.CannotPlaceAreaReinforcementWarn
Can't find a host for Area Reinforcement.

Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.CannotPlaceAreaReinforcement
Can't find a host for Area Reinforcement.

Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.BarsTooSparseSpacing
Bar spacing is greater than the size of the reinforced region. Decrease the Maximum Spacing parameter.

Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.BarsTooCloseSpacing
Bars are too close together. Increase the Maximum Spacing parameter.

Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.BarsTooCloseNumber
Bars are too close together. Decrease the Number Of Lines parameter.

Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.AreaReinforcementsCollision
Area Reinforcements are colliding.  Aligning the Major Directions, or changing the Additional Offsets, can prevent collision.

Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.AreaReinforcementWrongHost
Area Reinforcement can be placed only in Structural Floors and straight Structural Walls.

Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.AreaReinforcementRegenFail
Can't regenerate Area Reinforcement.

Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.AreaReinforcementOutSideOfHost
Area Reinforcement is sketched completely outside of its host.

Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures
Failures related to rebar systems.